saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.EFM32Gxxx_DFP.1.4.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>EFM32Gxxx_DFP</name>
  <description>Silicon Labs EFM32 Gecko Series Device Support</description>

  <releases>
    <release version="1.4.0" date="2018-01-15" deprecated="2018-01-15" replacement="SiliconLabs.EFM32G_DFP">
      The maintenance of this pack will be discontinued and SiliconLabs is providing the new pack SiliconLabs.EFM32G_DFP.
    </release>
    <release version="1.3.0" date="2017-06-22">
      Updated device support files to V5.1.3.
      Updated Flash Algorithms to 5.2.0.
      Updated SVD files to V5.2.1.
      Updated emlib, emdrv to V5.1.3.
      Updated documentation.
    </release>
    <release version="1.2.0" date="2016-04-22">
      Updated device support files to V4.2.1.
      Updated emlib, emdrv to V4.2.1.
    </release>
    <release version="1.1.0" date="2015-07-31">
      Updated device support files to V4.0.0.
      Added emlib support.
      Changed Device Vendor to '"Silicon Labs:21".
      Corrected Flash Algorithm size.
    </release>
    <release version="1.0.1" date="2014-02-20">
      Device description updated with features and flash programming algorithms
    </release>
    <release version="1.0.0">
      First Release version of EFM32 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EFM32G</keyword>
    <keyword>EFM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFM32G Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="0" Dmpu="1" Dendian="Little-endian"/>
      <processor Dclock="32000000"/>

      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <book name="Documents/EFM32-Cortex-M3-RM.pdf"      title="EFM32 Cortex-M3 Reference Manual"/>
      <book name="Documents/EFM32G-RM.pdf"               title="EFM32G Reference Manual"/>

      <description>
Silicon Labs' EFM32™ Gecko 32-bit microcontroller (MCU) family includes 25 devices that offer flash memory configurations up to 128 kB, 8–16 kB of RAM and CPU speeds up to 32 MHz.
Based on the powerful ARM® Cortex®-M3 core, the Gecko family features innovative low energy techniques, short wake-up time from energy saving modes and a wide selection of peripherals, making it ideal for battery operated applications and other systems requiring high performance and low-energy consumption.
      </description>

      <feature type="VCC"           n="1.85"    m="3.80"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="AnalogOther"   n="1"                           name="Supply Voltage Comparator"/>
      <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
      <feature type="I2C"           n="1"/>
      <feature type="UART"          n="1"/>
      <feature type="WDT"           n="1"                           name="Watchdog Timer with dedicated RC oscillator @ 50 nA"/>
      <feature type="Timer"         n="1"       m="24"/>
      <feature type="DMA"           n="8"/>
      <feature type="XTAL"          n="4"       m="32"/>
      <feature type="IntRC"         n="4"       m="32"              name="Internal RC Oscillator with +/- 2% accuracy"/>
      <feature type="Crypto"        n="1"       m="128.256"         name="Hardware AES in 54/75 cycles"/>


      <!-- ************************  Subfamily 'EFM32G200'  **************************** -->
      <subFamily DsubFamily="EFM32G200">
        <feature type="Touch"         n="5"/>
        <feature type="USART"         n="2"/>
        <feature type="SPI"           n="2"/>
        <feature type="ExtInt"        n="14"/>
        <feature type="Timer"         n="1"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="4"       m="12"/>
        <feature type="IOs"           n="24"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="QFN"           n="32"/>

        <book name="Documents/EFM32G200.pdf" title="EFM32G200 Data Sheet"/>

        <!-- *************************  Device 'EFM32G200F16'  ***************************** -->
        <device Dname="EFM32G200F16">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G200F16"/>
          <debug svd="SVD/EFM32G/EFM32G200F16.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00004000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G200F32'  ***************************** -->
        <device Dname="EFM32G200F32">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G200F32"/>
          <debug svd="SVD/EFM32G/EFM32G200F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G200F64'  ***************************** -->
        <device Dname="EFM32G200F64">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G200F64"/>
          <debug svd="SVD/EFM32G/EFM32G200F64.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32G210'  **************************** -->
      <subFamily DsubFamily="EFM32G210">
        <feature type="Touch"         n="5"/>
        <feature type="USART"         n="2"/>
        <feature type="SPI"           n="2"/>
        <feature type="ExtInt"        n="14"/>
        <feature type="Timer"         n="1"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="4"       m="12"/>
        <feature type="IOs"           n="24"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="QFN"           n="32"/>

        <book name="Documents/EFM32G210.pdf" title="EFM32G210 Data Sheet"/>

        <!-- *************************  Device 'EFM32G210F128'  ***************************** -->
        <device Dname="EFM32G210F128">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G210F128"/>
          <debug svd="SVD/EFM32G/EFM32G210F128.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32G222'  **************************** -->
      <subFamily DsubFamily="EFM32G222">
        <feature type="Touch"         n="12"/>
        <feature type="USART"         n="2"/>
        <feature type="SPI"           n="2"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="Timer"         n="2"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="4"       m="12"/>
        <feature type="IOs"           n="37"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="QFP"           n="48"/>

        <book name="Documents/EFM32G222.pdf" title="EFM32G222 Data Sheet"/>

        <!-- *************************  Device 'EFM32G222F32'  ***************************** -->
        <device Dname="EFM32G222F32">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G222F32"/>
          <debug svd="SVD/EFM32G/EFM32G222F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

