saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.EFM32Gxxx_DFP.1.4.0.pdsc
        <!-- *************************  Device 'EFM32G840F64'  ***************************** -->
        <device Dname="EFM32G840F64">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G840F64"/>
          <debug svd="SVD/EFM32G/EFM32G840F64.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G840F128'  ***************************** -->
        <device Dname="EFM32G840F128">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G840F128"/>
          <debug svd="SVD/EFM32G/EFM32G840F128.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32G842'  **************************** -->
      <subFamily DsubFamily="EFM32G842">
        <feature type="Touch"         n="8"/>
        <feature type="USART"         n="3"/>
        <feature type="SPI"           n="3"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="LCD"           n="1"       m="4.22"/>
        <feature type="Timer"         n="3"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="IOs"           n="53"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="QFP"           n="64"/>

        <book name="Documents/EFM32G842.pdf" title="EFM32G842 Data Sheet"/>

        <!-- *************************  Device 'EFM32G842F32'  ***************************** -->
        <device Dname="EFM32G842F32">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G842F32"/>
          <debug svd="SVD/EFM32G/EFM32G842F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G842F64'  ***************************** -->
        <device Dname="EFM32G842F64">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G842F64"/>
          <debug svd="SVD/EFM32G/EFM32G842F64.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G842F128'  ***************************** -->
        <device Dname="EFM32G842F128">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G842F128"/>
          <debug svd="SVD/EFM32G/EFM32G842F128.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32G880'  **************************** -->
      <subFamily DsubFamily="EFM32G880">
        <feature type="Touch"         n="16"/>
        <feature type="USART"         n="3"/>
        <feature type="SPI"           n="3"/>
        <feature type="ExtBus"        n="1"       m="16"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="LCD"           n="1"       m="4.40"/>
        <feature type="Timer"         n="3"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="IOs"           n="86"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="QFP"           n="100"/>

        <book name="Documents/EFM32G880.pdf" title="EFM32G880 Data Sheet"/>

        <!-- *************************  Device 'EFM32G880F32'  ***************************** -->
        <device Dname="EFM32G880F32">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G880F32"/>
          <debug svd="SVD/EFM32G/EFM32G880F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G880F64'  ***************************** -->
        <device Dname="EFM32G880F64">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G880F64"/>
          <debug svd="SVD/EFM32G/EFM32G880F64.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G880F128'  ***************************** -->
        <device Dname="EFM32G880F128">
          <compile header="Device/EFM32G/Include/em_device.h" define="EFM32G880F128"/>
          <debug svd="SVD/EFM32G/EFM32G880F128.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32G890'  **************************** -->
      <subFamily DsubFamily="EFM32G890">
        <feature type="Touch"         n="16"/>
        <feature type="USART"         n="3"/>
        <feature type="SPI"           n="3"/>
        <feature type="ExtBus"        n="1"       m="16"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="LCD"           n="1"       m="4.40"/>
        <feature type="Timer"         n="3"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="IOs"           n="90"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="BGA"           n="112"/>

